web/flask.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en-US" xml:lang="en-US">
<head>
<!-- 2017-11-20 Mon 18:04 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Flask</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="ChrisChen" />
<meta name="keywords" content="flask, backend" />
<link rel="stylesheet" type="text/css" href="../styles/demo/css/demo.css"/>
<link href="https://fonts.proxy.ustclug.org/css?family=Roboto+Slab:400,700|Inconsolata:400,700" rel="stylesheet" type="text/css" />
</head>
<body>
<div id="content">
<h1 class="title">Flask</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org46017e7">1. Context</a></li>
<li><a href="#org75b502e">2. Request hooks</a></li>
<li><a href="#orgc909dc0">3. Jinja2 template engine</a>
<ul>
<li><a href="#orga2827dd">3.1. Filters</a></li>
<li><a href="#org445416b">3.2. Control structures</a></li>
<li><a href="#orgbe2bf4d">3.3. Inheritance</a></li>
<li><a href="#org790a95e">3.4. Custom Error Pages</a></li>
<li><a href="#org334ffdb">3.5. Links</a></li>
<li><a href="#org5593597">3.6. Static files</a></li>
</ul>
</li>
<li><a href="#org9aa8cf0">4. ext</a>
<ul>
<li><a href="#orgafe861e">4.1. flask_script</a></li>
<li><a href="#orgd47d89f">4.2. flask_bootstrap</a></li>
<li><a href="#org64cba3e">4.3. flask_moment</a></li>
</ul>
</li>
</ul>
</div>
</div>
<div id="outline-container-org46017e7" class="outline-2">
<h2 id="org46017e7"><span class="section-number-2">1</span> Context</h2>
<div class="outline-text-2" id="text-1">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Variable name</th>
<th scope="col" class="org-left">Context</th>
<th scope="col" class="org-left">Description</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">current_app</td>
<td class="org-left">Application context</td>
<td class="org-left">The application instance for the active application</td>
</tr>

<tr>
<td class="org-left">g</td>
<td class="org-left">Application context</td>
<td class="org-left">An object can use for temporary storage. reset with each request</td>
</tr>

<tr>
<td class="org-left">request</td>
<td class="org-left">Request context</td>
<td class="org-left">The request object, which encapsulates a http request</td>
</tr>

<tr>
<td class="org-left">session</td>
<td class="org-left">Request context</td>
<td class="org-left">The user session, a dictionary storage shared by requests within session</td>
</tr>
</tbody>
</table>
</div>
</div>
<div id="outline-container-org75b502e" class="outline-2">
<h2 id="org75b502e"><span class="section-number-2">2</span> Request hooks</h2>
<div class="outline-text-2" id="text-2">
<ul class="org-ul">
<li>before_first_request: register a function to run before the first request</li>
<li>before_request: register a function to run before each request</li>
<li>after_request: register a function to run after each request if no unhandled exceptions occurred</li>
<li>teardown_request: register a function to run after each request even if unhandled exceptions occurred</li>
</ul>
</div>
</div>
<div id="outline-container-orgc909dc0" class="outline-2">
<h2 id="orgc909dc0"><span class="section-number-2">3</span> Jinja2 template engine</h2>
<div class="outline-text-2" id="text-3">
<pre class="example">
&lt;p&gt;A value from a dictionary: {{ mydict['key'] }}.&lt;/p&gt;
&lt;p&gt;A value from a list: {{ mylist[3] }}.&lt;/p&gt;
&lt;p&gt;A value from a list, with a variable index: {{ mylist[myintvar] }}.&lt;/p&gt;
&lt;p&gt;A value from an object's method: {{ myobj.somemethod() }}.&lt;/p&gt;
</pre>
</div>
<div id="outline-container-orga2827dd" class="outline-3">
<h3 id="orga2827dd"><span class="section-number-3">3.1</span> Filters</h3>
<div class="outline-text-3" id="text-3-1">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Filter name</th>
<th scope="col" class="org-left">Description</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">safe</td>
<td class="org-left">Renders the value without applying escaping</td>
</tr>

<tr>
<td class="org-left">capitalize</td>
<td class="org-left">Converts the first char to uppercase</td>
</tr>

<tr>
<td class="org-left">lower</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">upper</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">title</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">trim</td>
<td class="org-left">Removes leading and trailing whitespace</td>
</tr>

<tr>
<td class="org-left">striptags</td>
<td class="org-left">Removes any HTML tags</td>
</tr>
</tbody>
</table>
</div>
<div id="outline-container-orgc404f3d" class="outline-4">
<h4 id="orgc404f3d"><span class="section-number-4">3.1.1</span> safe</h4>
<div class="outline-text-4" id="text-3-1-1">
<ul class="org-ul">
<li>Never use the safe filter on values that aren’t trusted, such as text entered by users on web forms.</li>
</ul>
</div>
</div>
</div>
<div id="outline-container-org445416b" class="outline-3">
<h3 id="org445416b"><span class="section-number-3">3.2</span> Control structures</h3>
<div class="outline-text-3" id="text-3-2">
</div><div id="outline-container-org6028706" class="outline-4">
<h4 id="org6028706"><span class="section-number-4">3.2.1</span> if</h4>
<div class="outline-text-4" id="text-3-2-1">
<pre class="example">
{% if user %}
    Hello, {{ user }}!
{% else %}
    Hello, Stranger!
{% endif %}
</pre>
</div>
</div>
<div id="outline-container-org28f24b9" class="outline-4">
<h4 id="org28f24b9"><span class="section-number-4">3.2.2</span> loop</h4>
<div class="outline-text-4" id="text-3-2-2">
<pre class="example">
&lt;ul&gt;
    {% for comment in comments %}
        &lt;li&gt;{{ comment }}&lt;/li&gt;
    {% endfor %}
&lt;/ul&gt;
</pre>
</div>
</div>
<div id="outline-container-org0ff470a" class="outline-4">
<h4 id="org0ff470a"><span class="section-number-4">3.2.3</span> macro</h4>
<div class="outline-text-4" id="text-3-2-3">
<pre class="example">
{% macro render_comment(comment) %}
    &lt;li&gt;{{ comment }}&lt;/li&gt;
{% endmacro %}

&lt;ul&gt;
    {% for comment in comments %}
        {{ render_comment(comment) }}
    {% endfor %}
&lt;/ul&gt;
</pre>
<ul class="org-ul">
<li>import macro from file</li>
</ul>
<pre class="example">
{% import 'macros.html' as macros %}
&lt;ul&gt;
    {% for comment in comments %}
        {{ macros.render_comment(comment) }}
    {% endfor %}
&lt;/ul&gt;
</pre>
<ul class="org-ul">
<li>{% include 'common.html' %}</li>
</ul>
</div>
</div>
</div>
<div id="outline-container-orgbe2bf4d" class="outline-3">
<h3 id="orgbe2bf4d"><span class="section-number-3">3.3</span> Inheritance</h3>
<div class="outline-text-3" id="text-3-3">
<ul class="org-ul">
<li><p>
base
</p>
<div class="org-src-container">
<pre class="src src-html">&lt;<span style="color: #6c3163; font-weight: bold;">html</span>&gt;
&lt;<span style="color: #6c3163; font-weight: bold;">head</span>&gt;
    {% block head %}
    &lt;<span style="color: #6c3163; font-weight: bold;">title</span>&gt;<span style="font-weight: bold; text-decoration: underline;">{% block title %}{% endblock %} - My Application</span>&lt;/<span style="color: #6c3163; font-weight: bold;">title</span>&gt;
    {% endblock %}
&lt;/<span style="color: #6c3163; font-weight: bold;">head</span>&gt;
&lt;<span style="color: #6c3163; font-weight: bold;">body</span>&gt;
    {% block body %}
    {% endblock %}
&lt;/<span style="color: #6c3163; font-weight: bold;">body</span>&gt;
&lt;/<span style="color: #6c3163; font-weight: bold;">html</span>&gt;
</pre>
</div></li>
<li><p>
extendsion
</p>
<div class="org-src-container">
<pre class="src src-html">{% extends <span style="color: #2d9574;">"base.html"</span> %}
{% block title %}Index{% endblock %}
{% block head %}
    {{ super() }} <span style="color: #2aa1ae; background-color: #ecf3ec;">&lt;!--</span><span style="color: #2aa1ae; background-color: #ecf3ec;">super() to retain the original contents </span><span style="color: #2aa1ae; background-color: #ecf3ec;">--&gt;</span>
    &lt;<span style="color: #6c3163; font-weight: bold;">style</span>&gt;
    &lt;/<span style="color: #6c3163; font-weight: bold;">style</span>&gt;
{% endblock %}
{% block body %}
&lt;<span style="color: #6c3163; font-weight: bold;">h1</span>&gt;<span style="font-weight: bold; text-decoration: underline;">Hello, World!</span>&lt;/<span style="color: #6c3163; font-weight: bold;">h1</span>&gt;
{% endblock %}
</pre>
</div></li>
</ul>
</div>
</div>
<div id="outline-container-org790a95e" class="outline-3">
<h3 id="org790a95e"><span class="section-number-3">3.4</span> Custom Error Pages</h3>
<div class="outline-text-3" id="text-3-4">
<div class="org-src-container">
<pre class="src src-python"><span style="color: #ba2f59; font-weight: bold;">@app.errorhandler</span><span style="color: #3a81c3;">(</span><span style="color: #4e3163;">404</span><span style="color: #3a81c3;">)</span>
<span style="color: #3a81c3; font-weight: bold;">def</span> <span style="color: #6c3163; font-weight: bold;">page_not_found</span><span style="color: #3a81c3;">(</span>e<span style="color: #3a81c3;">)</span>:
    <span style="color: #3a81c3; font-weight: bold;">return</span> render_template<span style="color: #3a81c3;">(</span><span style="color: #2d9574;">'404.html'</span><span style="color: #3a81c3;">)</span>, <span style="color: #4e3163;">404</span>

<span style="color: #ba2f59; font-weight: bold;">@app.errorhandler</span><span style="color: #3a81c3;">(</span><span style="color: #4e3163;">500</span><span style="color: #3a81c3;">)</span>
<span style="color: #3a81c3; font-weight: bold;">def</span> <span style="color: #6c3163; font-weight: bold;">internal_server_error</span><span style="color: #3a81c3;">(</span>e<span style="color: #3a81c3;">)</span>:
    <span style="color: #3a81c3; font-weight: bold;">return</span> render_template<span style="color: #3a81c3;">(</span><span style="color: #2d9574;">'500.html'</span><span style="color: #3a81c3;">)</span>, <span style="color: #4e3163;">500</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-org334ffdb" class="outline-3">
<h3 id="org334ffdb"><span class="section-number-3">3.5</span> Links</h3>
<div class="outline-text-3" id="text-3-5">
<p>
<b>url_for()</b> function to generate URLs from the imformation stored in the app's URL map.
</p>
<div class="org-src-container">
<pre class="src src-python">url_for<span style="color: #3a81c3;">(</span><span style="color: #2d9574;">'user'</span>, name=<span style="color: #2d9574;">'john'</span>, _external=<span style="color: #4e3163;">True</span><span style="color: #3a81c3;">)</span> <span style="color: #2aa1ae; background-color: #ecf3ec;"># </span><span style="color: #2aa1ae; background-color: #ecf3ec;">return http://localhost:5000/user/john</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-org5593597" class="outline-3">
<h3 id="org5593597"><span class="section-number-3">3.6</span> Static files</h3>
<div class="outline-text-3" id="text-3-6">
<div class="org-src-container">
<pre class="src src-python">url_for<span style="color: #3a81c3;">(</span><span style="color: #2d9574;">'static'</span>, filename=<span style="color: #2d9574;">'css/styles.css'</span>, _external=<span style="color: #4e3163;">True</span><span style="color: #3a81c3;">)</span>
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-org9aa8cf0" class="outline-2">
<h2 id="org9aa8cf0"><span class="section-number-2">4</span> ext</h2>
<div class="outline-text-2" id="text-4">
</div><div id="outline-container-orgafe861e" class="outline-3">
<h3 id="orgafe861e"><span class="section-number-3">4.1</span> flask_script</h3>
</div>
<div id="outline-container-orgd47d89f" class="outline-3">
<h3 id="orgd47d89f"><span class="section-number-3">4.2</span> flask_bootstrap</h3>
<div class="outline-text-3" id="text-4-2">
<p>
base template blocks
</p>
<ul class="org-ul">
<li>doc, html_attribs, html, head, title, metas, styles, body_attribs, body, navbar, content, scripts</li>
</ul>
</div>
</div>
<div id="outline-container-org64cba3e" class="outline-3">
<h3 id="org64cba3e"><span class="section-number-3">4.3</span> flask_moment</h3>
<div class="outline-text-3" id="text-4-3">
<p>
Localization of dates and times
</p>
</div>
</div>
</div>
</div>
</body>
</html>
